#include <stdlib.h>
#include <stdio.h>
#include <math.h>
																									/* for проходить по елементах які я визначив*/
int main() {
	int a, b;																			// Константи числа що вводиться
	char vidp [3];																	 // Відповідь користувача на продовження програми
	system("chcp 1251 & cls");									// Українізація в консолі
	do {
		do {
			printf("Привіт!\nНапиши тільки день свого народження: ");
			scanf_s("%d", &a);  									  // Збираємо дані користувача
			fseek(stdin, 0, SEEK_END);						 // Очистка буфера
			if (a > 0 && a <= 31) {								// Перевірка на виконання умови
				printf("\nУспішно!!");
			}
			else {																// Перевірка на невиконання умови
				printf("\nНевдача!");
			}
		} while (a <= 0 || a > 31);
		printf("\nПродовжувати роботу? ");
		while ((vidp = getchar()) == ' ' || vidp == '\n' || vidp == '\t');
		fseek(stdin, 0, SEEK_END);
	} while (vidp == 'Yes' || vidp == 'yes' || vidp == "Так" || vidp == "так" || vidp == 'OK' || vidp == 'ok' || vidp == "ок" || vidp == "ОК" || vidp == 'y' || vidp == 'Y' || vidp == 'YES' || vidp == "ТАК");
	do {
		printf("\nГаразд, тепер спробуємо місяць: ");
		scanf_s("%d", &b);  									  // Збираємо дані користувача
		fseek(stdin, 0, SEEK_END);						 // Очистка буфера
		if (a > 0 && a <= 12) {								// Перевірка на виконання умови
			printf("\nУспішно!!");
		}
		else { // Перевірка на невиконання умови
			printf("\nНевдача!");
		}
	} while (a <= 0 || a > 12);
	printf("\nОтже твій день народження буде: %d, %d \n\n", a, b); /*Знак амперсанта (&) використовується для ЗЧИТУВАННЯ даних, а не виведення*/
	system("pause");
	return 0;
}
